{"description":["The Lamborghini Aventador SVJ is a limited-production, high-performance supercar with a naturally aspirated V12 engine producing 759 horsepower. It features advanced aerodynamics and cutting-edge technology, making it one of the fastest and most aggressive Lamborghinis ever made.","The Ferrari LaFerrari is a hybrid hypercar that combines a V12 engine with an electric motor, producing a combined output of 950 horsepower. It boasts a top speed of over 217 mph and is known for its striking design and exceptional performance.","The Porsche 911 GT2 RS is a high-performance sports car with a rear-engine layout and a twin-turbocharged flat-six engine generating 700 horsepower. It is designed for track-focused driving and is known for its impressive speed and agility.","The Bugatti Divo is a limited-edition hypercar based on the Chiron platform. It features a quad-turbocharged 8.0-liter W16 engine producing 1,479 horsepower and boasts extreme aerodynamics and handling capabilities, making it one of the most exclusive and sought-after supercars in the world.","The McLaren P1 is a hybrid hypercar with a combined power output of 903 horsepower from its V8 engine and electric motor. It features advanced aerodynamics and a lightweight carbon fiber construction, making it a formidable performer on both road and track.","The Koenigsegg Jesko is a hypercar with a twin-turbocharged V8 engine producing up to 1,600 horsepower on E85 biofuel. It features innovative technologies such as a 9-speed multi-clutch transmission and advanced aerodynamics, making it one of the most technologically advanced supercars on the market.","The Aston Martin Valkyrie is a hypercar developed in collaboration with Red Bull Racing. It features a naturally aspirated V12 engine producing over 1,000 horsepower and boasts an extreme aerodynamic design and advanced hybrid technology, making it a true masterpiece of automotive engineering.","The Mercedes-AMG One is a hypercar powered by a Formula 1-derived hybrid powertrain. It features a 1.6-liter V6 engine and four electric motors, producing a combined output of over 1,000 horsepower. It is known for its cutting-edge technology and unparalleled performance.","The Lamborghini Huracan Performante is a high-performance version of the Huracan sports car. It features a naturally aspirated V10 engine producing 640 horsepower and boasts advanced aerodynamics, lightweight construction, and improved handling, making it one of the fastest Lamborghinis ever produced.","The Audi R8 V10 Plus is a high-performance sports car powered by a naturally aspirated V10 engine producing 610 horsepower. It features a mid-engine layout, all-wheel drive, and advanced driving dynamics, making it a thrilling driving experience on both road and track.","The Ford GT is a legendary American supercar with a twin-turbocharged V6 engine producing 660 horsepower. It features a lightweight carbon fiber construction, advanced aerodynamics, and track-inspired technologies, making it a formidable competitor on the race track.","The Chevrolet Corvette C8 ZR1 is a high-performance variant of the iconic American sports car. It features a supercharged V8 engine producing over 750 horsepower, advanced aerodynamics, and track-oriented suspension, making it one of the most powerful and capable Corvettes ever built.","The Rimac C_Two is an all-electric hypercar with a total power output of 1,914 horsepower. It features advanced electric drivetrain technology, cutting-edge aerodynamics, and autonomous driving capabilities, making it one of the most innovative and high-performance electric supercars on the market.","The Lamborghini Sian FKP 37 is a limited-edition hybrid hypercar with a naturally aspirated V12 engine combined with an electric motor, producing a combined output of 819 horsepower. It features extreme aerodynamics, unique design elements, and innovative hybrid technology, paying homage to the late Ferdinand Karl Piëch, former chairman of the Volkswagen Group.","The McLaren 765LT is a high-performance supercar with a twin-turbocharged V8 engine producing 765 horsepower. It features lightweight construction, advanced aerodynamics, and track-focused technologies, making it one of the fastest and most agile McLaren supercars ever produced.","The Pagani Huayra BC is an ultra-exclusive hypercar powered by a twin-turbocharged V12 engine producing 791 horsepower. It features a lightweight carbon fiber construction, advanced aerodynamics, and bespoke craftsmanship, making it a true work of automotive art.","The Porsche 911 GT3 RS is a high-performance sports car based on the iconic 911 platform. It features a naturally aspirated flat-six engine producing 520 horsepower, track-focused suspension, and aerodynamic enhancements, making it a favorite among driving enthusiasts and racing enthusiasts alike.","The Lamborghini Essenza SCV12 is a limited-edition track-only hypercar with a naturally aspirated V12 engine producing over 830 horsepower. It features extreme aerodynamics, lightweight construction, and race-ready features, making it one of the most exclusive and high-performance Lamborghinis ever created.","The Lotus Evija is an all-electric hypercar with a total power output of 1,973 horsepower, making it one of the most powerful production cars ever built. It features advanced electric drivetrain technology, lightweight carbon fiber construction, and cutting-edge aerodynamics, making it an extraordinary blend of performance, innovation, and sustainability.","The Bugatti Chiron Super Sport 300+ is a limited-edition hypercar that set a world speed record for a production car, reaching a top speed of 304.773 mph. It features a quad-turbocharged W16 engine producing 1,578 horsepower, advanced aerodynamics, and exclusive design elements, making it one of the most powerful and fastest cars ever created.","The Bugatti Chiron is a hypercar with a quad-turbocharged W16 engine producing 1,500 horsepower, capable of reaching a top speed of over 300 mph. It features advanced aerodynamics, cutting-edge technology, and luxurious craftsmanship, making it one of the most exclusive and high-performance cars in the world.","The Koenigsegg Jesko is a hypercar with a 5.0-liter twin-turbo V8 engine producing over 1,600 horsepower, making it one of the most powerful production cars. It boasts advanced aerodynamics, lightweight construction, and innovative features like the world's lightest transmission, making it a top contender in the hypercar segment.","The Rimac C_Two is an all-electric hypercar with four electric motors producing a combined output of 1,914 horsepower. It features cutting-edge technology, including autonomous driving capabilities, and can accelerate from 0 to 60 mph in under 2 seconds, making it one of the fastest hypercars in the world.","The McLaren Speedtail is a hybrid hypercar with a top speed of 250 mph, making it one of the fastest cars ever produced. It features a 4.0-liter twin-turbo V8 engine combined with an electric motor, producing a total output of 1,055 horsepower. Its sleek design, innovative features, and luxurious interior make it a true masterpiece of automotive engineering.","The Lamborghini Sián FKP 37 is a limited-edition hybrid hypercar with a total output of 819 horsepower. It features a naturally aspirated V12 engine combined with an electric motor, making it the most powerful Lamborghini ever produced. Its futuristic design, advanced technology, and exclusive features make it a highly coveted hypercar among collectors and enthusiasts.","The Aston Martin Valkyrie is a hypercar developed in collaboration with Red Bull Racing, featuring cutting-edge aerodynamics and engineering. It is powered by a naturally aspirated V12 engine producing over 1,000 horsepower, and boasts a lightweight construction, advanced suspension system, and race-inspired design. Its limited production and extreme performance make it a true automotive icon.","The Mercedes-AMG Project One is a hybrid hypercar with Formula One-inspired technology. It features a 1.6-liter V6 turbocharged engine combined with four electric motors, producing a total output of over 1,000 horsepower. It boasts advanced aerodynamics, lightweight construction, and innovative features, making it one of the most technologically advanced hypercars ever built.","The Ferrari LaFerrari is a hybrid hypercar with a V12 engine combined with an electric motor, producing a total output of 950 horsepower. It features advanced aerodynamics, cutting-edge technology, and a luxurious interior. Its limited production, extreme performance, and iconic Ferrari design make it a highly sought-after hypercar.","The Porsche 918 Spyder is a hybrid hypercar with a V8 engine combined with two electric motors, producing a total output of 887 horsepower. It features advanced aerodynamics, lightweight construction, and innovative features like a plug-in hybrid system, making it one of the most technologically advanced hypercars ever built.","The Lamborghini Centenario is a limited-edition hypercar with a naturally aspirated V12 engine producing 770 horsepower. It features cutting-edge aerodynamics, lightweight materials, and exclusive design elements, making it a true masterpiece of automotive engineering. Its extreme performance, rarity, and iconic Lamborghini styling make it highly desirable among collectors and enthusiasts.","The Pagani Huayra is a hypercar with a twin-turbo V12 engine producing up to 800 horsepower. It features a unique design, advanced aerodynamics, and bespoke craftsmanship, with many components handcrafted by artisans. Its performance, exclusivity, and attention to detail make it a true work of automotive art.","The Lamborghini Veneno is a limited-edition hypercar with a naturally aspirated V12 engine producing 740 horsepower. It features extreme aerodynamics, lightweight materials, and a futuristic design inspired by fighter jets. Its rarity, radical styling, and extreme performance make it a highly collectible hypercar.","The McLaren P1 is a hybrid hypercar with a twin-turbo V8 engine combined with an electric motor, producing a total output of 903 horsepower. It features advanced aerodynamics, lightweight construction, and race-inspired technology, making it one of the fastest cars on the planet. Its limited production, extreme performance, and iconic McLaren design make it a true automotive legend.","The Bugatti Divo is a limited-edition hypercar with a quad-turbocharged W16 engine producing 1,500 horsepower. It features a unique design, advanced aerodynamics, and exclusive performance features, making it one of the most exclusive and high-performance hypercars in the world. Its rarity, extreme performance, and exquisite craftsmanship make it a true masterpiece of automotive engineering.","The Rolls-Royce Phantom is a flagship luxury sedan known for its opulence, craftsmanship, and comfort. It features a powerful V12 engine, exquisite handcrafted interior, advanced technology, and a smooth, serene ride. The Phantom is a symbol of automotive luxury and elegance, favored by discerning customers who demand the highest level of luxury and exclusivity.","The Bentley Mulsanne is a luxury sedan that represents the pinnacle of British automotive craftsmanship. It boasts a distinctive design, a hand-built V8 engine, and an opulent interior with premium materials and advanced technology. The Mulsanne offers a serene and comfortable ride, and it's packed with features that cater to the needs of its discerning passengers. With its combination of performance, luxury, and exclusivity, the Bentley Mulsanne is a statement of refined taste and automotive excellence.","The Maybach S650 is a luxurious variant of the Mercedes-Benz S-Class, renowned for its opulence, comfort, and cutting-edge technology. It features a powerful V12 engine, a lavish and spacious interior with premium materials, and an array of advanced safety and convenience features. The Maybach S650 offers an unparalleled level of comfort and refinement, with features such as massaging seats, ambient lighting, and a state-of-the-art infotainment system. It's the epitome of automotive luxury, designed for those who demand the finest things in life.","The Mercedes-Benz S-Class Maybach is a luxurious and prestigious sedan that sets new standards for comfort, luxury, and performance. It features a refined and powerful engine, an exquisitely crafted interior with high-quality materials and cutting-edge technology, and a host of advanced safety and convenience features. The S-Class Maybach offers an unrivaled level of luxury, with features such as heated and ventilated seats, a Burmester surround sound system, and a sophisticated air suspension system for a smooth and comfortable ride. It's a true masterpiece of automotive engineering, perfect for those who demand the very best.","The BMW 7 Series is a flagship luxury sedan known for its dynamic performance, cutting-edge technology, and refined craftsmanship. It features a range of powerful engines, advanced driving assistance systems, and a luxurious interior with high-quality materials and modern design. The 7 Series offers a smooth and comfortable ride, with features such as adaptive air suspension, ambient lighting, and an intuitive infotainment system. It's a symbol of luxury and driving pleasure, perfect for those who appreciate the finest details and uncompromising performance.","The Audi A8 L is a luxurious sedan that epitomizes sophistication, elegance, and innovation. It features a striking design, a comfortable and spacious interior, and a host of advanced technology and safety features. The A8 L offers a refined and comfortable ride, with features such as a smooth air suspension, heated and ventilated seats, and a cutting-edge infotainment system. It's a perfect blend of luxury, performance, and innovation, designed for those who demand the best of both worlds.","The Lexus LS is a flagship luxury sedan renowned for its exceptional quality, comfort, and reliability. It features a refined and powerful engine, a plush and well-appointed interior, and a wealth of advanced safety and convenience features. The LS offers a serene and comfortable ride, with features such as adaptive suspension, premium audio system, and an array of driver assistance technologies. It's a symbol of luxury and craftsmanship, perfect for those who appreciate refined luxury and attention to detail.","The Jaguar XJ is a luxury sedan that exudes elegance, performance, and exclusivity. It features a distinctive design, a powerful engine, and a refined interior with a combination of traditional craftsmanship and modern technology. The XJ offers a thrilling driving experience, with features such as adaptive dynamics, configurable ambient lighting, and a panoramic glass roof. It's a statement of style and performance, perfect for those who appreciate a blend of British heritage and contemporary luxury.","The Genesis G90 is a premium luxury sedan that offers a refined and sophisticated driving experience. It features a powerful engine, a spacious and opulent interior with premium materials, and a comprehensive suite of advanced safety and convenience features. The G90 offers a comfortable and quiet ride, with features such as adaptive suspension, Nappa leather seats, and a Lexicon premium audio system. It's a testament to the Korean brand's commitment to delivering luxury and performance, perfect for those who seek a unique and compelling luxury sedan.","The Porsche Panamera Turbo S is a high-performance luxury sedan that offers thrilling performance and exceptional comfort. It features a powerful twin-turbo V8 engine, a sleek and sporty design, and a luxurious interior with cutting-edge technology. The Panamera Turbo S offers sports car-like performance, with features such as all-wheel drive, adaptive air suspension, and advanced driver assistance systems. It's a perfect blend of performance and luxury, designed for those who demand the best of both worlds.","The Aston Martin DB11 is a grand tourer that embodies elegance, luxury, and performance. It features a stunning design, a powerful V8 or V12 engine, and a sumptuous interior with handcrafted details. The DB11 offers a thrilling driving experience, with features such as adaptive damping, torque vectoring, and a sophisticated infotainment system. It's a true British icon, perfect for those who appreciate the art of grand touring.","The McLaren GT is a luxury sports car that combines performance, comfort, and practicality. It features a mid-engine design, a powerful V8 engine, and a refined interior with premium materials. The GT offers supercar-like performance, with features such as lightweight construction, adaptive suspension, and advanced aerodynamics. It's a unique blend of sportiness and luxury, perfect for those who crave the thrill of driving and the comfort of a grand tourer.","The Ferrari Portofino is a convertible sports car that delivers an exhilarating driving experience and uncompromising luxury. It features a powerful V8 engine, a retractable hardtop roof, and a luxurious interior with state-of-the-art technology. The Portofino offers breathtaking performance, with features such as adaptive suspension, electronic differential, and an advanced infotainment system. It's a perfect blend of performance and open-air driving, designed for those who demand the finest Italian craftsmanship and performance.","The Lamborghini Urus is a high-performance luxury SUV that offers a unique combination of power, agility, and versatility. It features a powerful V8 engine, a striking design, and a luxurious interior with cutting-edge technology. The Urus offers sports car-like performance, with features such as all-wheel drive, adaptive air suspension, and advanced driver assistance systems. It's a statement of extravagance and performance, perfect for those who want to stand out from the crowd.","The Bentley Bentayga is a luxury SUV that embodies opulence, craftsmanship, and performance. It features a powerful engine, a stately design, and a handcrafted interior with the finest materials. The Bentayga offers a refined and comfortable ride, with features such as adaptive air suspension, bespoke cabin finishes, and advanced driver assistance systems. It's a symbol of luxury and exclusivity, perfect for those who demand the utmost in comfort and performance.","The Range Rover Autobiography is the pinnacle of luxury SUVs, offering exceptional comfort, refinement, and versatility. It features a powerful engine, a plush and spacious interior with top-notch materials, and advanced technology for off-road capability and on-road comfort. The Autobiography boasts a commanding presence on the road, with features such as air suspension, terrain response system, and a suite of driver assistance systems. It's the ultimate SUV for those who demand the very best in luxury and performance.","The Mercedes-AMG G63 is a high-performance luxury SUV that combines ruggedness, power, and opulence. It features a handcrafted V8 engine, an iconic boxy design, and a lavish interior with sporty accents. The G63 offers blistering performance, with features such as all-wheel drive, AMG-tuned suspension, and performance brakes. It's a statement of power and prestige, perfect for those who want an SUV that stands out both on and off the road.","The Audi Q8 is a luxury SUV that offers a sleek and sophisticated design, cutting-edge technology, and refined comfort. It features a powerful engine, a spacious and well-appointed interior, and advanced driver assistance systems. The Q8 offers a dynamic driving experience, with features such as all-wheel drive, adaptive air suspension, and a virtual cockpit with a plethora of infotainment options. It's a perfect blend of style, performance, and versatility, suitable for those who appreciate modern luxury.","The BMW X7 is a full-size luxury SUV that offers a premium driving experience, abundant space, and advanced technology. It features a powerful engine, a luxurious and comfortable interior, and a refined ride quality. The X7 offers a versatile driving experience, with features such as all-wheel drive, adaptive suspension, and a plethora of convenience and safety features. It's a statement of luxury and performance, perfect for those who want a prestigious and spacious SUV.","The Rolls-Royce Cullinan is the epitome of luxury SUVs, offering unparalleled opulence, craftsmanship, and performance. It features a powerful V12 engine, a handcrafted interior with the finest materials, and cutting-edge technology. The Cullinan offers a serene and refined driving experience, with features such as all-wheel drive, air suspension, and advanced driver assistance systems. It's a masterpiece of automotive luxury, designed for those who demand the utmost in exclusivity and comfort.","The Lexus LX is a luxurious and capable SUV that offers a combination of comfort, reliability, and off-road prowess. It features a powerful V8 engine, a spacious and well-appointed interior, and a reputation for Lexus' renowned craftsmanship and quality. The LX offers a smooth and refined ride, with features such as all-wheel drive, adaptive suspension, and advanced safety features. It's a perfect choice for those who want a reliable and luxurious SUV for both on-road and off-road adventures.","The BMW M5 is a high-performance luxury sedan that offers thrilling performance, exceptional handling, and premium amenities. It features a powerful V8 engine, sporty exterior design, and a luxurious interior with advanced technology. The M5 offers a dynamic driving experience, with features such as rear-wheel drive, adaptive suspension, and performance brakes. It's a perfect choice for those who want a sports car-like performance in a practical and luxurious sedan.","The McLaren 540C is a luxury sports car that offers breathtaking performance, cutting-edge technology, and distinctive styling. It features a powerful V8 engine, lightweight construction, and aerodynamic design. The 540C offers an exhilarating driving experience, with features such as rear-wheel drive, adaptive suspension, and advanced driving modes. It's a true supercar that's designed for those who demand the ultimate in performance and exclusivity.","The Lexus NX is a luxury compact SUV that offers a blend of comfort, versatility, and advanced technology. It features a stylish exterior design, a refined and well-appointed interior, and a reputation for Lexus' renowned reliability. The NX offers a smooth and comfortable ride, with features such as all-wheel drive, a hybrid powertrain option, and a suite of driver assistance systems. It's a practical and luxurious choice for those who want a compact SUV with premium amenities.","The Bentley Continental GT V8 Convertible is a luxury grand tourer that offers open-top driving, exceptional comfort, and exquisite craftsmanship. It features a powerful V8 engine, a convertible soft top, and a lavish interior with handcrafted details. The Continental GT V8 Convertible offers a luxurious and refined driving experience, with features such as all-wheel drive, air suspension, and advanced infotainment and connectivity options. It's a statement of opulence and performance, perfect for those who appreciate the finer things in life.","The Aston Martin Vantage Roadster is a luxury convertible sports car that offers a blend of performance, style, and open-air driving. It features a powerful V8 engine, a striking exterior design, and a handcrafted interior with premium materials. The Vantage Roadster offers an exhilarating driving experience, with features such as rear-wheel drive, adaptive suspension, and a convertible soft top. It's a perfect choice for those who want a sports car that combines elegance and excitement.","The Mercedes-Benz GLC Coupe is a luxury compact SUV that offers a sleek and sporty design, advanced technology, and refined performance. It features a stylish coupe-like roofline, a comfortable and well-appointed interior, and a wide range of engine options. The GLC Coupe offers a balanced blend of comfort and agility, with features such as all-wheel drive, air suspension, and advanced driver assistance systems. It's a unique and luxurious choice for those who want a sporty SUV with a touch of elegance.","A luxury electric sedan with impressive performance, range, and features.","A more affordable electric sedan designed for mass production and wider adoption.","A premium electric SUV with unique falcon-wing doors and impressive performance.","A compact electric SUV that offers a balance of space, performance, and affordability.","A futuristic, all-electric pickup truck with a unique design and impressive capabilities.","A high-performance, all-electric sports car with exceptional acceleration and top speed.","An all-electric, heavy-duty truck designed for commercial hauling with zero emissions.","A rumored compact electric hatchback that has not been officially released by Tesla.","A midsize sedan that combines a gasoline engine with an electric motor for improved fuel efficiency and reduced emissions.","A compact SUV that offers a hybrid powertrain for enhanced fuel economy and lower environmental impact.","A compact sedan that features a hybrid system for excellent fuel efficiency and a sleek, modern design.","A midsize sedan that offers both electric and gasoline-powered driving modes, with the ability to recharge the battery using an external power source.","Toyota GR Supra with a 3.0-liter inline 6-cylinder engine.","Toyota GR Supra with a 3.0-liter inline 6-cylinder engine and premium features.","Toyota GR Supra A91 Edition with unique styling and features.","Toyota GR Supra with a 2.0-liter inline 4-cylinder engine.","Toyota GR Supra with a 2.0-liter inline 4-cylinder engine and premium features.","Nissan GT-R Nismo, the high-performance version of the GT-R with upgraded performance and features.","Nissan GT-R Premium, the base model GT-R with standard features and performance.","Nissan GT-R Track Edition, a performance-focused version with track-oriented upgrades."],"names":["Lamborghini Aventador SVJ","Ferrari LaFerrari","Porsche 911 GT2 RS","Bugatti Divo","McLaren P1","Koenigsegg Jesko","Aston Martin Valkyrie","Mercedes-AMG One","Lamborghini Huracan Performante","Audi R8 V10 Plus","Ford GT","Chevrolet Corvette C8 ZR1","Rimac C_Two","Lamborghini Sian FKP 37","McLaren 765LT","Pagani Huayra BC","Porsche 911 GT3 RS","Lamborghini Essenza SCV12","Lotus Evija","Bugatti Chiron Super Sport 300+","Bugatti Chiron","McLaren Speedtail","Aston Martin Valkyrie","Mercedes-AMG Project One","Porsche 918 Spyder","Lamborghini Centenario","Pagani Huayra","Lamborghini Veneno","McLaren P1","Rolls-Royce Phantom","Bentley Mulsanne","Maybach S650","Mercedes-Benz S-Class Maybach","BMW 7 Series","Audi A8 L","Lexus LS","Jaguar XJ","Genesis G90","Porsche Panamera Turbo S","Aston Martin DB11","McLaren GT","Ferrari Portofino","Lamborghini Urus","Bentley Bentayga","Range Rover Autobiography","Mercedes-AMG G63","Audi Q8","BMW X7","Rolls-Royce Cullinan","Lexus LX","BMW M5","McLaren 540C","Lexus NX","Bentley Continental GT V8 Convertible","Aston Martin Vantage Roadster","Mercedes-Benz GLC Coupe","Tesla Model S","Tesla Model 3","Tesla Model X","Tesla Model Y","Tesla Cybertruck","Tesla Roadster (2nd Generation)","Tesla Semi","Tesla Model B (unreleased)","Honda Accord Hybrid","Honda CR-V Hybrid","Honda Insight","Honda Clarity Plug-in Hybrid","Toyota GR Supra 3.0","Toyota GR Supra 3.0 Premium","Toyota GR Supra A91 Edition","Toyota GR Supra 2.0","Toyota GR Supra 2.0 Premium","Nissan GT-R Premium","Nissan GT-R Track Edition"], "prices": ["$600,000", "$3 million", "$350,000", "$6 million", "$1.5 million", "$3.5 million", "$3.5 million", "$3 million", "$350,000", "$250,000", "$600,000", "$200,000", "$2.5 million", "$3.5 million", "$400,000", "$3 million", "$250,000", "$3 million", "$2.5 million", "$4 million", "$3.3 million", "$2.5 million", "$3.5 million", "$3 million", "$1.2 million", "$3 million", "$3 million", "$4.5 million", "$1.5 million", "$500,000", "$350,000", "$250,000", "$225,000", "$150,000", "$110,000", "$100,000", "$100,000", "$85,000", "$200,000", "$250,000", "$250,000", "$225,000"]}
